/*
* Old datas for miwifi_log.html
* The file miwifi_log.js is using this file
* Latest version on 2014-10-20 16:15
*/

	var logData = [
	  {
			"logtype": "小米路由器Mini 开发版0.5.78",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_59acf_0.5.78.bin",
			"time": 1413388800000,
			"type": "blue",
			"title": "小米路由器Mini 开发版 0.5.78 第17周更新日志",
			"content": 
				"<p>最新推荐：</p>" +
				"<p>新增媒体服务程序，路由器存储的照片、影片，可通过小米电视、盒子可视化管理，获得更完美畅快的大屏体验。</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了安全恢复系统下升级时相关问题</li>" + 
				  "<li>修复了某些情况下USB设备在使用过程中会被设为只读的问题</li>" + 
				  "<li>优化了无线中继功能的稳定性</li>" + 
				  "<li>修复批量删除中包含重复文件时返回错误提示的问题</li>" + 
				  "<li>修复了某些情况下修改设备备注名称，在设备列表里不生效的问题</li>" + 
				  "<li>修复了中继模式下中继设备IP地址不正确的问题</li>" + 
				  "<li>优化了获取文件修改时间的策略，增加重试机制和失败后的应对策略</li>" + 
				  "<li>优化了MiTV两次查询影片海报信息返回结果不一致时的处理策略</li>" + 
				  "<li>优化了存储清理策略，优化日志文件的清理机制</li>" + 
				  "<li>修复了智能摄像机和智能插座首次连接网络，会错误触发陌生设备提醒的问题</li>" + 
				"</ol>" +
				"<p>App 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了APP在后台运行时断网，导致部分手机返回键和音量键失灵的问题</li>" + 
				  "<li>优化了路由快连动画效果</li>" + 
				  "<li>修复了路由快连可能出现异常退出的问题</li>" + 
				  "<li>修复了某些情况下，摄像头侦测报警的通知无法打开的问题 </li>" + 
				  "<li>修复了某些情况下，选择允许摄像头报警时间段出现异常的问题</li>" + 
				  "<li>修复了路由成绩单分享到QQ空间时文字不显示的问题</li>" + 
				  "<li>修复了某些情况下智能限速设置无法打开的问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器ROM 开发版0.8.45",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_92146_0.8.45.bin",
			"time": 1413388800000,
			"type": "blue",
			"title": "小米路由器ROM 开发版 第43周更新日志",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>优化了磁盘4K对齐检测的相关策略</li>" + 
				  "<li>修复了音频文件索引时可能出现异常的问题</li>" + 
				  "<li>新增了对音乐类型文件ID3信息的支持</li>" + 
				  "<li>新增了第三方插件“网页广告拦截”的拦截次数统计</li>" + 
				  "<li>修复了在分类视图删除文件后，刷新界面后文件还存在的问题</li>" + 
				  "<li>修复了批量删除中包含重复文件时返回错误提示的问题</li>" + 
				  "<li>修复了某些情况下修改设备备注名称，在设备列表里不生效的问题</li>" + 
				  "<li>修复了中继模式下中继设备IP地址不正确的问题</li>" + 
				  "<li>优化了获取文件修改时间的策略，增加重试机制和失败后的应对策略</li>" + 
				  "<li>优化了MiTV两次查询影片海报信息返回结果不一致时的处理策略</li>" + 
				  "<li>优化了存储清理策略，优化日志文件的清理机制</li>" + 
				  "<li>修复了智能摄像机和智能插座首次连接网络，会错误触发陌生设备提醒的问题</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了浏览相册时图片功能在小内存手机上无法运行的问题 </li>" + 
				  "<li>新增了对分类视图中滑动切换Tab操作的支持</li>" + 
				  "<li>新增了快盘同步的文件的当前状态显示</li>" + 
				  "<li>修复了从分类视图进入快盘设置页后点击返回会导致App崩溃的问题</li>" + 
				  "<li>修复了APP在后台运行时断网，导致部分手机返回键和音量键失灵的问题</li>" + 
				  "<li>优化了路由快连动画效果</li>" + 
				  "<li>修复了路由快连可能出现异常退出的问题</li>" + 
				  "<li>修复了某些情况下，摄像头侦测报警的通知无法打开的问题</li>" + 
				  "<li>修复了某些情况下，选择允许摄像头报警时间段出现异常的问题 </li>" + 
				  "<li>修复了路由成绩单分享到QQ空间时文字不显示的问题</li>" + 
				  "<li>修复了某些情况下智能限速设置无法打开的问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版0.5.67",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_firmware_687d3_0.5.67.bin",
			"time": 1412956800000,
			"type": "blue",
			"title": "小米路由器Mini 开发版 0.5.67 第16周更新日志",
			"content": 
				"<p>最新推荐：</p>" +
				"<p>新增了对小米智能家居新品的支持，搭配小米路由器可获得更优质的体验，PS：稳定版同样支持优化了智能场景中关闭wifi、路由器的时间选项，支持自定义时长</p>" +
				"<p>新增了指定设备获得网络优先权的功能，让你的重要设备尊享优质网络</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了对小蚁智能摄像机、小米智能插座和Yeelight智能灯的支持</li>" + 
				  "<li>优化了USB设备在使用过程中出现只读情况的处理策略</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了对小蚁智能摄像机、小米智能插座和Yeelight智能灯的支持</li>" + 
				  "<li>新增了设置页的智能限速选项</li>" + 
				  "<li>新增了让指定设备获得网络优先权的功能</li>" + 
				  "<li>新增了智能场景关闭WiFi、关闭路由器时自定义关闭时长</li>" + 
				  "<li>优化了网络优化功能的动画流畅度</li>" + 
				  "<li>修复了绑定路由器数量较多时，界面溢出的问题</li>" + 
				  "<li>修复了ROM降级导致的app异常退出的问题</li>" + 
				  "<li>新增了同一个设备重复添加智能场景时的冲突检测</li>" + 
				  "<li>路由成绩单支持分享到QQ空间</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器ROM 开发版0.8.30",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_b0ad8_0.8.30.bin",
			"time": 1412956800000,
			"type": "blue",
			"title": "小米路由器ROM 开发版 第42周更新日志",
			"content": 
				"<p>最新推荐：</p>" +
				"<p>新增了对小米智能家居新品的支持，搭配小米路由器可获得更优质的体验，PS：稳定版同样支持优化了智能场景中关闭wifi、路由器的时间选项，支持自定义时长</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了对小蚁智能摄像机、小米智能插座和Yeelight智能灯的支持</li>" + 
				  "<li>优化了拷贝大量图片导致扫描慢的问题</li>" + 
				  "<li>修复了数据库图片信息错误的问题</li>" + 
				  "<li>优化了USB设备在使用过程中出现只读情况的处理策略</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了对小蚁智能摄像机、小米智能插座和Yeelight智能灯的支持</li>" + 
				  "<li>新增了设置页的智能限速选项</li>" + 
				  "<li>新增了让指定设备获得网络优先权的功能</li>" + 
				  "<li>新增了智能场景关闭WiFi、关闭路由器时自定义关闭时长</li>" + 
				  "<li>修复了相册视图时间显示异常问题</li>" + 
				  "<li>优化了相册视图和影片视图下拉刷新策略并修复一个可能导致app异常退出的问题</li>" + 
				  "<li>修复了绑定路由器数量较多时，界面溢出的问题</li>" + 
				  "<li>修复了ROM降级导致的app异常退出的问题</li>" + 
				  "<li>新增了同一个设备重复添加智能场景时的冲突检测</li>" + 
				  "<li>路由成绩单支持分享到QQ空间</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器ROM 开发版0.8.9",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_5077f_0.8.9.bin",
			"time": 1411574400000,
			"type": "blue",
			"title": "小米路由器ROM 开发版 第41周更新日志",
			"content": 
				"<p>最新推荐：</p>" +
				"<p>新增了安卓App中文件管理的分类视图，可分类查看路由盘内的影片和图片，更快捷的找到你想要的文件。</p>" +
				"<p>除了备份手机相册，PC的文件也可以备份至小米路由器了，重要的文件自动备份，安全、省心。</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了路由盘文件的分类视图，可分类浏览路由器的视频、图片文件</li>" + 
				  "<li>新增第三方插件“迅雷游戏加速”</li>" + 
				  "<li>优化了设备的流量统计，使其变得更加准确</li>" + 
				  "<li>优化了使用PPTP/L2TP时访问本地资源的判断策略</li>" + 
				  "<li>优化了数据备份时视频文件的去重策略</li>" + 
				  "<li>优化了应用限速策略，默认会自动调整迅雷下载的限制速度</li>" + 
				  "<li>修复了路由器意外断电后，可能出现的reset不成功的问题</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了文件管理的相册视图和影片视图</li>" + 
				  "<li>优化了首页界面，对页面细节进行了微调</li>" + 
				"</ol>" +
				"<p>PC Client 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了PC的文件备份功能，可将PC的指定目录或全盘文档备份至路由器</li>" + 
				  "<li>新增了客户端自动登录功能，不必每次验证密码</li>" + 
				  "<li>修复了一些bug，提高了稳定性</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_4f961_0.5.44.bin",
			"time": 1411574400000,
			"type": "blue",
			"title": "小米路由器Mini 开发版 0.5.44 第十五周更新日志",
			"content": 
				"<p>最新推荐：</p>" +
				"<p>新增网络优化功能，在Wi-Fi网络不顺畅的时候，可通过手机App优化路由器的Wi-Fi信道，避开干扰，更畅快的享受无线网络。</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了网络优化功能，可优化路由器的Wi-Fi信道，避开干扰，让无线网络更加稳定</li>" + 
				  "<li>新增了2.4G没有开启的情况下，进入中继模式的引导策略</li>" + 
				  "<li>修复了手动设置Wi-Fi频段带宽后，带宽无法固定的问题</li>" + 
				  "<li>修复了设置DDNS时，某些正常状况下报错问题</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了信道优化功能</li>" + 
				  "<li>优化了首页界面，对页面细节进行了微调</li>" + 
				"</ol>" +
				"<p>PC Client 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了客户端自动登录功能，不必每次验证密码</li>" + 
				  "<li>修复了一些bug，提高了稳定性</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器mini 稳定版 0.5.8",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_cc515_0.5.8.bin",
			"time": 1411574400000,
			"type": "blue",
			"title": "小米路由器mini 稳定版 0.5.8 更新日志",
			"content": 
				"<p>热点功能</p>" +
				"<ol>" +
				  "<li>优化了USB外接存储的体验，存储、下载、访问的体验更畅快了</li>" + 
				  "<li>新增了NTFS存储格式的支持，PC/Mac客户端可访问存储设备了</li>" + 
				  "<li>升级了迅雷下载引擎，下载更加稳定</li>" + 
				"</ol>" +
				"<p>新第三方插件</p>" +
				"<ol>" +
				  "<li>新增第三方插件“迅播影院”，海量资源一键下载</li>" + 
				"</ol>" +
				"<p>功能与优化</p>" +
				"<ol>" +
				  "<li>优化了5G Wi-Fi的稳定性，OTA升级也更加可靠了</li>" + 
				"</ol>" +
				"<p>更多细节改进</p>" +
				"<ol>" +
				  "<li>新增了对NTFS存储格式的支持</li>" + 
				  "<li>增加了PC客户端与MAC客户端对插入USB存储设备之后的相关支持</li>" + 
				  "<li>新增加第三方插件“迅播影院”，请在插件中心中搜索非官方插件添加</li>" + 
				  "<li>优化了QoS智能限速策略，开关QoS功能不再需要重启路由器</li>" + 
				  "<li>优化了web管理后台高级设置中导航方式与UI的细节体验</li>" + 
				  "<li>优化了Android APP在插入USB存储设备之后的初始化体验，以及USB存储设备异常的相关处理</li>" + 
				  "<li>更新了插件“小米精彩时刻”，更多小米产品2014年最新高清视频</li>" + 
				  "<li>优化了5G Wi-Fi的稳定性</li>" + 
				  "<li>修复了中继模式与路由器模式切换后可能带来的无线网络加密方式设置项的bug</li>" + 
				  "<li>更新了迅雷下载引擎，升级到更加稳定、修复了诸多问题的版本</li>" + 
				  "<li>修复了当路由器重启或者升级后，连接的设备名称变成MAC地址的Bug</li>" + 
				  "<li>修复了OTA或刷机后，偶现的黄灯常亮无法启动的问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器ROM 稳定版 0.7.61",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_4ea3c_0.7.61b.bin",
			"time": 1411574400000,
			"type": "blue",
			"title": "小米路由器ROM 稳定版 0.7.61 更新日志",
			"content": 
				"<p>热点功能</p>" +
				"<ol>" +
				  "<li>手机相册一键备份至小米路由器，家庭私有云，数据安全不丢失</li>" + 
				  "<li>小米路由成绩单，根据你的上网习惯，生成周报，分享至社交网络</li>" + 
				"</ol>" +
				"<p>新第三方插件</p>" +
				"<ol>" +
				  "<li>新增“迅雷游戏加速”插件，有效降低网络延迟，更畅快的游戏体验</li>" + 
				  "<li>新增“网页广告过滤”插件，清除广告页面清爽，更舒适的浏览体验</li>" + 
				  "<li>新增“光影照片管家”插件，更新“小米精彩时刻”的视频资源</li>" + 
				"</ol>" +
				"<p>功能与优化</p>" +
				"<ol>" +
				  "<li>优化了PPPoE拨号、DHCP的可靠性，外网连接更加稳定</li>" + 
				  "<li>优化了下载的稳定性，升级迅雷下载引擎，修复了某些情况下无法加速的bug</li>" + 
				  "<li>新增DMZ，DDNS等高级功能，优化了QoS智能限速功能</li>" + 
				  "<li>新增了USB接口对exFAT文件系统的支持</li>" + 
				"</ol>" +
				"<p>更多细节改进</p>" +
				"<ol>" +
				  "<li>优化了QoS智能限速功能，在线看视频的时候，网络游戏的延迟更小了</li>" + 
				  "<li>优化了系统日志的记录策略，更少的访问硬盘以延长寿命</li>" + 
				  "<li>修复了当资源url过长时，迅雷下载引擎无法顺利加速的问题</li>" + 
				  "<li>修复了一些潜在的安全漏洞，优化了web管理后台登录的安全性</li>" + 
				  "<li>优化了Web管理页面的菜单分类与功能排序</li>" + 
				  "<li>优化了OTA升级的可靠性，ROM安装文件更加轻简</li>" + 
				  "<li>修改刷机时MD5验证方案，让刷机更加靠谱</li>" + 
				  "<li>修复了智能场景中，定时开机后不能联网的问题，并校准了智能场景的执行时间</li>" + 
				  "<li>修复了设备管理列表中，连接设备的信息可能显示错误的问题</li>" + 
				  "<li>优化了PPTP/L2TP功能本地网络流量智能判断策略，增加了对host规则里不同类型规则的支持</li>" + 
				  "<li>优化了网络测速功能，下行带宽的测速更加精准</li>" + 
				  "<li>优化了Wi-Fi对部分DELL机型所使用网卡的兼容性</li>" + 
				  "<li>修复了USB接口插U盘后，偶现的访问出错的问题</li>" + 
				  "<li>优化了外网设置调整后WAN口和DNSmasq的重启策略</li>" + 
				  "<li>修复了DHCP静态IP绑定功能手工输入与绑定可能失败的bug</li>" + 
				  "<li>修复PPPoE拨号在某些状况下无法连接的问题，提高拨号上网的成功率</li>" + 
				  "<li>修复小部分用户网络检测时，DNS解析失败的问题</li>" + 
				  "<li>修复了手机上传的视频在某些状况下无法显示的Bug</li>" + 
				  "<li>修复了小米电视/盒子通过DLNA访问路由器有个别文件夹无法显示的问题</li>" + 
				  "<li>修复了获取CPU温度错误的Bug</li>" + 
				  "<li>修复了多个目录删除时会重复提醒的bug</li>" + 
				  "<li>修复了重复上传相同文件去重失败的bug</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_firmware_2f207_0.5.30.bin",
			"time": 1410969600000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.5.30",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了PPPoE拨号断线检测和重连功能</li>" + 
				  "<li>修复了有时下行测速失败的问题，并优化了测速的准确度</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了插件的用户许可协议页面</li>" + 
				  "<li>修复了绑定多个路由器时左边栏显示不完整的bug</li>" + 
				  "<li>修复了开关按钮关闭状态下样式异常的bug</li>" + 
				  "<li>修复了更改WiFi加密类型后确定按钮不可点的bug</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM 第40周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_fcf26_0.7.97.bin",
			"time": 1410969600000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版0.7.97",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了有时mac地址克隆不成功的问题</li>" + 
				  "<li>修复了有时下行测速失败的问题，并优化了测速的准确度</li>" + 
				  "<li>增加了相册备份目录自定义名称的功能</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了插件的用户许可协议页面</li>" + 
				  "<li>修复了绑定多个路由器时左边栏显示不完整的bug</li>" + 
				  "<li>修复了开关按钮关闭状态下样式异常的bug</li>" + 
				  "<li>修复了更改WiFi加密类型后确定按钮不可点的bug</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_firmware_77398_0.5.16.bin",
			"time": 1410451200000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.5.16",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了中继模式下上级路由器名称有可能显示错误的问题</li>" + 
				  "<li>修复了端口转发时，无法用QoS限制接收UDP包的问题</li>" + 
				  "<li>修复了PPPoE拨号断开后，有时无法自动连接的问题</li>" + 
				  "<li>修复了测速有时失败的问题</li>" + 
				  "<li>优化了下载完成之后，消息提醒推送到手机的策略</li>" + 
				"</ol>" +
				"<p>小米电视/盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>新增查看被隐藏视频的密码找回功能</li>" + 
				  "<li>全屏浏览图片的页面菜单改版</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM 第39周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_2fe91_0.7.82.bin",
			"time": 1410451200000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版0.7.82",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>优化了插件安装体验，本地安装时支持覆盖安装，无须先卸载</li>" + 
				  "<li>新增外网设置为静态IP时，支持配置变长子网掩码</li>" + 
				  "<li>修复了PPPoE拨号断开后，有时无法自动连接的问题</li>" + 
				  "<li>修复了测速有时失败的问题</li>" + 
				  "<li>优化了下载完成之后，消息提醒推送到手机的策略</li>" + 
				"</ol>" +
				"<p>小米电视/盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>新增查看被隐藏视频的密码找回功能</li>" + 
				  "<li>全屏浏览图片的页面菜单改版</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_firmware_c51f9_0.5.4.bin",
			"time": 1409760000000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.5.4",
			"content": 
				"<p>本周推荐：</p>" +
				"<p>新增对NTFS文件系统的支持，USB接口支持各种主流格式的U盘和移动硬盘了</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了对NTFS存储格式的支持</li>" + 
				  "<li>新增了自动信道优化功能，优化无线上网体验</li>" + 
				  "<li>修复了当路由器重启或者升级后，连接的设备名称变成MAC地址的Bug</li>" + 
				  "<li>优化了5G Wi-Fi的稳定性</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了“小米路由成绩单”功能偶发崩溃的bug</li>" + 
				  "<li>新增了对“小米路由成绩单”分享结果的提示</li>" + 
				  "<li>修复了版本显示的问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM 第38周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_1dc9a_0.7.63.bin",
			"time": 1409760000000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版 0.7.63",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了当路由器重启或者升级后，连接的设备名称变成MAC地址的Bug</li>" + 
				  "<li>修复了手工设置子网掩码的一个bug</li>" + 
				  "<li>修复了读取硬盘图片时候的一个bug</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了从备份界面跳转到路由存储界面相应位置的功能</li>" + 
				  "<li>新增了对备份根目录被删除的情况下重新备份的处理</li>" + 
				  "<li>修复了“小米路由成绩单”功能偶发崩溃的bug</li>" + 
				  "<li>新增了对“小米路由成绩单”分享结果的提示</li>" + 
				  "<li>修复了版本显示的问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_firmware_77f56_0.4.96.bin",
			"time": 1409241600000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.4.96",
			"content": 
				"<p>特别推荐：</p>" +
				"<p>PC/MAC客户端推出！欢迎到miwifi.com下载体验（或点击web界面右上角的“下载”）QoS智能限速功能正式推出！再也不用担心多设备同时打游戏、看视频会冲突的问题。新插件——迅播影院，更多视频资源、更快更新速度！</p>" +
				"<p>本周更新：</p>" +
				"<ol>" +
				  "<li>增加了QoS智能限速功能，支持系统自动智能限速与手工编辑限速值两种模式</li>" + 
				  "<li>增加了PC客户端与MAC客户端对插入USB存储设备之后的相关支持</li>" + 
				  "<li>优化了QoS智能限速策略，开关QoS功能不再需要重启路由器</li>" + 
				  "<li>优化了OTA升级策略，插入USB存储后的升级相关策略更加完善</li>" + 
				  "<li>优化了web管理后台高级设置中导航方式与UI的细节体验</li>" + 
				  "<li>优化了Android APP在插入USB存储设备之后的初始化体验，以及USB存储设备异常的相关处理</li>" + 
				  "<li>修复了中继模式与路由器模式切换后可能带来的无线网络加密方式设置项的bug</li>" + 
				  "<li>更新了迅雷下载引擎，升级到更加稳定、修复了诸多问题的版本</li>" + 
				  "<li>更新了插件“小米精彩时刻”，更多小米产品2014年最新高清视频</li>" + 
				  "<li>新增加第三方插件“迅播影院”，请在插件中心中搜索非官方插件添加</li>" + 
				"</ol>" +
				"<p>特别提示：</p>" +
				"<p>建议下行带宽50M以上的土豪们不要开启QoS，你们的网实在太快了，开启QoS会有可能带来一点点性能方面的小问题 ：）</p>"
			},
	  {
			"logtype": "MiWiFi ROM 第37周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_88c95_0.7.58.bin",
			"time": 1409155200000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版 0.7.58",
			"content": 
				"<p>本周推荐：</p>" +
				"<p>新增“小米路由成绩单”功能，对您使用路由器的情况做出总结和报告，还能和全世界的用户比拼数据呢！</p>" +
				"<p>您还可以分享成绩单到社交网络，告诉大家您是“5G达人”还是“电影狂人”，赶快试试吧~</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了PPPoE上网，路由器重启或者升级以后一段时间无法连接的问题</li>" + 
				  "<li>更新了插件“光影照片管家”，修复了之前版本插件的bug</li>" + 
				  "<li>更新了插件“小米精彩时刻”，更多小米2014年新品发布相关高清视频</li>" + 
				  "<li>将迅雷下载引擎更新到最新版本，进一步提升了迅雷引擎的稳定性</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>“小米路由成绩单”新鲜出炉</li>" + 
				  "<li>优化了功能入口，将卸载USB存储设备的入口移到标题栏</li>" + 
				  "<li>增加了备份单个文件过程中，对检测到非WiFi网络时做了停止备份的处理</li>" + 
				  "<li>增加了设备列表对中继状态小米路由器mini的识别</li>" + 
				  "<li>修复了魅族手机上智能设备和场景页标题栏的显示问题</li>" + 
				  "<li>修复了解绑了所有路由器之后，点击登录会导致app崩溃的问题</li>" + 
				"</ol>" +
				"<p>IOS App 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了对非官方认证插件的支持</li>" + 
				  "<li>增加了插件页面的导航条</li>" + 
				  "<li>增加了批量暂停下载任务的功能</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 稳定版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_0eb0a_0.4.86.bin",
			"time": 1408636800000,
			"type": "blue",
			"title": "小米路由器Mini 稳定版0.4.86",
			"content": 
				"<p>Hi~感谢你选择了小米路由器 ：）</p>" +
				"<p>无网络，不快活！小米路由器mini将伴随你度过每一天都更快活的智能路由器生活。</p>" +
				"<p>本次更新：</p>" +
				"<ol>" +
				  "<li>新增了对USB扩展存储的支持，插入U盘/移动硬盘初始化后即可使用迅雷下载、插件中心等功能！（支持FAT32/exFAT格式）</li>" + 
				  "<li>新增了迅雷离线下载功能，不用开电脑手机端轻松控制路由器随时随地添加下载任务</li>" + 
				  "<li>新增了路由插件中心，小米精彩时刻、迅雷云加速、迅雷电影院、迅雷影音已支持，更多精彩插件即将登场</li>" + 
				  "<li>新增了万能无线中继功能，不用再为家中老路由器信号覆盖不足而苦恼</li>" + 
				  "<li>新增了系统安全模式，当路由器因为刷机断电或其他异常操作而死机后将会进入安全模式（红灯闪烁）；安全模式下可以通过网络一键恢复系统，或U盘刷机恢复系统，小米路由器是一个真正不会刷死的智能路由器</li>" + 
				  "<li>优化了USB存储插入后的本地局域网播放功能，5G AC无线播放高清视频实测毫无压力</li>" + 
				  "<li>优化了无线中继功能对主路由器的兼容性</li>" + 
				  "<li>优化了路由器初始化流程对手机浏览器的适配</li>" + 
				  "<li>优化了插USB存储设备的判断逻辑，对于各种无法加载或只读的设备做更好的判断</li>" + 
				  "<li>优化了卸载USB存储设备后的清除缓存策略</li>" + 
				  "<li>优化了迅雷下载引擎，保证下载任务都能获得加速</li>" + 
				  "<li>修复了迅雷远程中设备在线/离线状态显示错误的bug</li>" + 
				  "<li>修复了插入USB设备获取磁盘空间的bug</li>" + 
				  "<li>修复了智能场景中只执行一次无法恢复的bug</li>" + 
				  "<li>修复了无线中继功能无法中继主路由为WEP加密方式的bug</li>" + 
				  "<li>修复了中继模式设置完成后有一定几率中继失败的bug</li>" + 
				  "<li>和MTK（小米路由器mini的芯片供应商）的小伙伴一起努力的提升了系统稳定性与无线Wi-Fi网络对不同网卡的兼容性</li>" + 
				"</ol>" +
				"<p>特别提示：</p>" +
				"<ol>" +
				  "<li>小米路由器mini稳定版ROM会每月更新，想要更早体验更多好玩功能请到miwifi.com官网下载并升级到每周更新的开发版</li>" + 
				  "<li>严重建议喜欢使用路由器外接存储迅雷下载的用户插入移动硬盘而不是U盘，这样才会获得更好的性能与体验</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_0e3da_0.4.85.bin",
			"time": 1408550400000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.4.85 第十周更新",
			"content": 
				"<p>特别推荐：</p>" +
				"<p>上周推出的USB存储设备相关支持功能颇受大家欢迎，本周我们趁热打铁优化了USB存储、迅雷下载等功能。</p>" +
				"<ol>" +
				  "<li>增加了USB外接存储设备对exFAT格式的支持</li>" + 
				  "<li>优化了无线中继功能的在初始化/切换工作模式时的引导流程与细节体验</li>" + 
				  "<li>优化了插USB存储设备的判断逻辑，对于各种无法加载或只读的设备做更好的判断</li>" + 
				  "<li>优化了卸载USB存储设备后的清除缓存策略</li>" + 
				  "<li>优化了迅雷下载引擎，保证下载任务都能获得加速</li>" + 
				  "<li>修复了迅雷远程中设备在线/离线状态显示错误的bug</li>" + 
				  "<li>修复了插入USB设备获取磁盘空间的bug</li>" + 
				  "<li>修复了智能场景中只执行一次无法恢复的bug</li>" + 
				  "<li>修复了某些情况时安装插件无法显示状态的bug</li>" + 
				"</ol>" +
				"<p>已知问题：</p>" +
				"<p>迅雷下载的速度无法在app上状态页的外网速度中体现，请暂时先用右侧的任务列表查看下载速度</p>" +
				"<p>特别鸣谢：</p>" +
				"<p>值此小米路由器mini正式开售之际，特别感谢mini公测米聊1/2群各位热心用户在过去整整十周的公测期间给予我们的帮助和支持！</p>" +
				"<p>公测版从本周起正式更名开发版，也欢迎公测用户们继续使用每周更新的开发版并继续通过米聊群、社区和微博反馈建议 ：）</p>"
			},
	  {
			"logtype": "MiWiFi ROM 第36周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_616eb_0.7.37.bin",
			"time": 1408550400000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版 0.7.37",
			"content": 
				"<p>本周推荐：</p>" +
				"<p>新增两款第三方插件，“网页广告过滤”更清爽的网页，更舒适的浏览体验；“光影照片管家”自动备份手机照片到路由器，精彩瞬间多一分安全。</p>" +
				"<p>集中优化了迅雷下载引擎，感谢迅雷的小伙伴，提供更畅快的下载体验。</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增插件“网页广告过滤”（第三方插件）</li>" + 
				  "<li>新增插件“光影照片管家”（第三方插件）</li>" + 
				  "<li>优化了QoS智能限速功能，自动限速模式下，部分应用的优先级别，让网络资源分配更合理</li>" + 
				  "<li>修复了当资源url过长时，迅雷下载引擎无法顺利加速的问题</li>" + 
				  "<li>修复了公测阶段，部分获赠迅雷白金会员的用户无法使用云加速的问题</li>" + 
				  "<li>修复了迅雷远程中经常会看到在线设备显示离线的问题</li>" + 
				  "<li>修复了一个OTA升级的小bug</li>" + 
				  "<li>修复了一个潜在的安全漏洞</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>优化了主界面的部分细节</li>" + 
				  "<li>优化了“备份手机相册”策略，在手机低电量下不触发备份</li>" + 
				  "<li>修复了关于“手机自动备份到路由器”的bug</li>" + 
				"</ol>" +
				"<p>MiTV&盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>“小米路由器”应用入口界面全新改版</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_9649d_0.4.68.bin",
			"time": 1408032000000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.4.68 第九周更新",
			"content": 
				"<p>本周推荐：</p>" +
				"<p>USB存储支持相关功能重装上阵，插入U盘/移动硬盘初始化后即可使用！</p>" +
				"<ol>" +
				  "<li>新增了迅雷离线下载功能，不用开电脑，手机端轻松控制路由器随时随地添加下载任务</li>" + 
				  "<li>新增了路由插件中心，小米精彩时刻、迅雷云加速、迅雷电影院、迅雷影音已支持，更多精彩插件即将登场</li>" + 
				  "<li>优化了USB存储插入后的本地局域网播放功能，5G AC无线播放高清视频实测毫无压力</li>" + 
				  "<li>优化了无线中继功能对主路由器的兼容性</li>" + 
				  "<li>修复了无线中继功能无法中继主路由为WEP加密方式的bug</li>" + 
				  "<li>修复了中继模式设置完成后有一定几率中继失败的bug</li>" + 
				  "<li>修复了中继模式切换回普通路由器模式后miwifi.com无法跳转路由器后台的问题</li>" + 
				"</ol>" +
				"<p>特别提示：</p>" +
				"<p>目前USB存储支持FAT32格式，对更多格式的支持与优化工作正在进行中，将很快推出。</p>" +
				"<p>严重建议喜欢长时间下载的用户插入移动硬盘使用而不是U盘，这样会获得更好的体验。</p>"
			},
	  {
			"logtype": "MiWiFi ROM 第35周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_0b632_0.7.22.bin",
			"time": 1407945600000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版 0.7.22",
			"content": 
				"<p>本周推荐：</p>" +
				"<p>新增一键备份功能，手机内的照片和拍摄的视频一键备份到路由器，保护数据不丢失，还能为宝贵的手机存储腾出空间。修复了一些网络相关的Bug，进一步优化上网体验。</p>" +
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>新增了对迅雷水晶插件网络层更好的支持</li>" + 
				  "<li>优化了PPTP/L2TP功能本地网络流量智能判断策略</li>" + 
				  "<li>优化了外网设置调整后WAN口和DNSmasq的重启策略</li>" + 
				  "<li>修复了多个目录删除时会重复提醒的bug</li>" + 
				  "<li>修复了重复上传相同文件去重失败的bug</li>" + 
				  "<li>修复了个别用户因为拨号后一段时间无流量，连接断开的问题</li>" + 
				  "<li>修复了使用DHCP上网时，上级DHCP服务器变更后，没有重新获取ip地址的问题</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>新增一键备份功能，备份手机照片和拍摄的视频</li>" + 
				  "<li>新增对APP开发版和稳定版的区分</li>" + 
				  "<li>新增APP和ROM不匹配时的提示</li>" + 
				  "<li>修复了插件页偶尔白屏的问题</li>" + 
				  "<li>修复了不能大批量删除文件的问题</li>" + 
				"</ol>" +
				"<p>MiTV&盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>更新 “升级路由器” 的界面</li>" + 
				  "<li>优化图片浏览体验，支持图片自动旋转</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_firmware_91d1e_0.4.50.bin",
			"time": 1407427200000,
			"type": "blue",
			"title": "小米路由器Mini 开发版 0.4.50",
			"content": 
				"<p>本周推荐：</p>" +
				"<p>正式推出无线中继功能，不用再为传统路由器厂商使用WDS/WISP所带来不同品牌不同型号的路由器无法中继的问题而苦恼。</p>" +
				"<p>小米路由器mini的无线中继理论上可以支持任何品牌/任何型号的路由器做主路由通过2.4G进行无线中继。</p>" +
				"<ol>" +
				  "<li>增加了无线中继功能，可以在初始化时选择进行中继或在设置中切换路由器工作模式与中继工作模式</li>" + 
				  "<li>优化了Wi-Fi的稳定性以及对部分网卡的兼容性</li>" + 
				  "<li>修复了日志文件有可能出现过大而带来的bug</li>" + 
				  "<li>和MTK的小伙伴一起努力的提升了稳定性</li>" + 
				"</ol>" +
				"<p>特别提示：</p>" +
				"<p>目前的无线中继功能还在优化过程中，对于部分品牌/型号路由器兼容性可能存在一定问题。欢迎大家在使用过程中将发现的问题通过公测群反馈给我们。</p>" +
				"<p>已知问题：</p>" +
				"<ol>" +
				  "<li>主路由2.4G 网络如果使用已经非常落后的WEP加密方式，建议修改加密方式后再进行中继否则有可能失败</li>" + 
				  "<li>从中继模式切换回路由器工作模式后，路由器名称没有修改</li>" + 
				  "<li>从中继模式切换回到普通路由器模式后有一定几率 miwifi.com 无法跳转到31.1的路由器管理后台</li>" + 
				  "<li>中继模式设置完成之后如果没有生效，请重启路由器即可解决</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM 第34周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_c8121_0.7.6.bin",
			"time": 1407340800000,
			"type": "blue",
			"title": "小米路由器 ROM 开发版 0.7.6",
			"content": 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了手机上传的视频在某些状况下无法显示的Bug</li>" + 
				  "<li>修复了PPPoE断开连接后，点击重连但不会生效的Bug</li>" + 
				  "<li>修复了获取CPU温度错误的Bug</li>" + 
				  "<li>优化了系统日志的记录策略，更少的访问硬盘以延长寿命</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>版本信息改为只在升级检测界面显示</li>" + 
				"</ol>" +
				"<p>MiTV&盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>优化自拍视频的匹配算法</li>" + 
				  "<li>修复了偶现的视频列表为空的bug</li>" + 
				"</ol>"
			},
	  {
			"logtype": "小米路由器Mini 开发版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_46ed1_0.4.36.bin",
			"time": 1406822400000,
			"type": "blue",
			"title": "小米路由器Mini 开发版0.4.36",
			"content": 
				"<ol>" +
				  "<li>增加了智能限速QoS和无线中继功能的底层支持，只是目前还在测试功能入口尚未开放</li>" + 
				  "<li>优化了web页面中多处ui细节与文字细节</li>" + 
				  "<li>优化了web页面中部分出错提示的显示方式</li>" + 
				  "<li>修复了Wi-Fi带宽选择的时可能出现的bug</li>" + 
				  "<li>修复了设备在DHCP IP&MAC地址绑定之后设备名称显示为MAC地址的BUG</li>" + 
				"</ol>" 
			},
	  {
			"logtype": "小米路由器Mini 稳定版",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_43243_0.4.20.bin",
			"time": 1406736000000,
			"type": "blue",
			"title": "小米路由器Mini 稳定版0.4.20",
			"content": 
				"<ol>" +
				  "<li>增加了PPTP/L2TP功能</li>" + 
				  "<li>提升了路由器整体的稳定性</li>" + 
				  "<li>优化了测速功能，下行带宽部分测速更加准确</li>" + 
				  "<li>优化了DDNS动态域名功能，更准确的获取当前DDNS服务状态</li>" + 
				  "<li>优化了无线访问控制功能，黑白名单的操作会更流畅</li>" + 
				  "<li>优化了Wi-Fi网络对更多不同设备网卡的兼容性</li>" + 
				  "<li>优化了路由器初始化流程对手机端的设备和细节体验</li>" + 
				  "<li>修复了设备管理列表中终端连接时间有可能显示错误的问题</li>" + 
				  "<li>修复了LAN口连接设备有时候会显示错误的问题</li>" + 
				  "<li>修复了OTA升级时候有可能会失败的一个小问题</li>" + 
				"</ol>" 
			},
	  {
			"logtype": "MiWiFi ROM 第33周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_aaa24_0.6.94.bin",
			"time": 1406736000000,
			"type": "blue",
			"title": "Mac用户的福音，新增对exFAT格式存储设备的支持",
			"content": 
			  "<p>Mac用户的福音，新增对exFAT格式存储设备的支持，家庭数据中心更加强大。iOS App迎来新版，海量影视，App首页一搜即下，众多体验优化，不容错过。ROM更加稳定，修复了困扰部分用户的小问题，上网更省心。</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复设备列表中，绑定IP的设备显示名字错误的问题</li>" + 
				  "<li>修复小部分用户网络检测时，DNS解析失败的问题</li>" + 
				  "<li>修复小部分用户检测不到升级包的问题</li>" + 
				  "<li>新增了USB接口对exFAT格式存储设备的支持</li>" + 
				  "<li>优化了Wi-Fi对部分DELL机型所使用网卡的兼容性</li>" + 
				  "<li>修复了USB接口插U盘后访问的一个小问题</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>每个插件页面增加前进后退的导航，操作更便捷</li>" + 
				"</ol>" +
				"<p>IOS App 更新日志：</p>" +
				"<ol>" +
				  "<li>资源搜索，海量影视，一搜即下</li>" + 
				  "<li>设备在线、离线状态，一目了然</li>" + 
				  "<li>全新版本升级，增加升级总进度、剩余时间</li>" + 
				  "<li>增加WiFi加密方式设置</li>" + 
				  "<li>优化绑定流程，绑定引导更明显、更友好</li>" + 
				  "<li>优化解绑流程，解绑离线设备体验更平顺</li>" + 
				  "<li>优化文件上传体验，速度提升10倍</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM for 小米路由器Mini",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_841b4_0.4.19.bin",
			"time": 1406217600000,
			"type": "blue",
			"title": "小米路由器mini 第六周 更新日志",
			"content": 
				"<ol>" +
				  "<li>增加了系统安全模式，当路由器因为刷机断电或其他异常操作而死机后将会进入安全模式（红灯闪烁）；安全模式下可以通过网络一键恢复系统，或U盘刷机恢复系统，一个真正不会刷死的智能路由器。</li>" + 
				  "<li>优化了路由器初始化流程对手机浏览器的适配</li>" + 
				  "<li>优化了路由器初始化流程的细节体验</li>" + 
				  "<li>优化了无线访问控制功能，增加刷新机制</li>" + 
				  "<li>修复了设备管理列表中终端流量统计的一个bug</li>" + 
				  "<li>修复了测速功能的浮层可能被意外关闭的小bug</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第32周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_15d9c_0.6.80.bin",
			"time": 1406131200000,
			"type": "blue",
			"title": "本周着重优化了网络稳定性，让上网体验更加畅快",
			"content": 
			  "<p>本周着重优化了网络稳定性，让上网体验更加畅快。Android客户的一些问题也得到了修正，一键升级和系统通知将更加靠谱。看起来更新并不多，但在Rom深处，我们悄悄埋下了几个新功能的种子，很快会发芽长大，敬请期待吧！</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了上传带宽非常小时，开启智能限速QoS功能可能出现的网络不正常问题</li>" + 
				  "<li>修复PPPoE拨号中一个潜在的问题，提高拨号成功率</li>" + 
				"</ol>" +
				"<p>电视&盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>浏览路由盘图片，支持左右旋转</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>修复手动上传插件时，因重名导致上传错误的问题</li>" + 
				  "<li>修复当所有设备离线时，不能一键升级的问题</li>" + 
				  "<li>修复了文件管理的若干bug</li>" + 
				  "<li>升级通知系统，通知更稳定更靠谱</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM for 小米路由器Mini",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_5c260_0.4.6.bin",
			"time": 1405612800000,
			"type": "blue",
			"title": "小米路由器mini 公测第五周 更新日志",
			"content": 
				"<ol>" +
				  "<li>增加了PPTP/L2TP功能，这个功能就无需更多描述了</li>" + 
				  "<li>优化了测速功能，下行带宽部分测速更加准确</li>" + 
				  "<li>优化了DDNS动态域名功能，更准确的获取当前DDNS服务状态</li>" + 
				  "<li>优化了无线访问控制功能</li>" + 
				  "<li>修复了设备管理列表中终端连接时间有可能显示错误的问题</li>" + 
				  "<li>修复了LAN口连接设备有时候会显示错误的问题</li>" + 
				  "<li>修复了OTA升级时候有可能会失败的一个小问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第31周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_7f967_0.6.69.bin",
			"time": 1405526400000,
			"type": "blue",
			"title": "新增第三方非认证插件的搜索入口，进一步优化了QoS智能限速",
			"content": 
			  "<p>为更及时的体验新插件，Android端新增了第三方非认证插件的搜索入口，方便您获取更多插件。进一步优化了QoS智能限速，让您更加从容的面对抢占网速的室友。优化了一些细节和体验，并修复Bug若干，赶快更新尝鲜吧！</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>优化了QoS智能限速功能，简单的说，在线看视频的时候，网络游戏的延迟更小了</li>" + 
				  "<li>优化了网络测速功能，下行带宽的测速更加精准</li>" + 
				  "<li>修复了设备管理列表中，终端连接时间可能显示错误的问题</li>" + 
				  "<li>修复了偶现的LAN口连接设备，显示为无线设备的问题</li>" + 
				  "<li>优化了DDNS动态域名功能，更准确的获取当前DDNS服务状态</li>" + 
				"</ol>" +
				"<p>电视&盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>优化图片浏览速度（小米路由器入口）</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>新增插件搜索入口，可以查看未经审核认证的第三方插件</li>" + 
				  "<li>为插件提供更多支持，使插件可推送消息提示到app首页</li>" + 
				  "<li>优化路由盘展示，隐私盘与路由盘之间的切换更顺畅了</li>" + 
				  "<li>优化文件上传的拾取界面</li>" + 
				  "<li>修复偶发的登录崩溃bug</li>" + 
				"</ol>" +
				"<p>PC Client 更新日志：</p>" +
				"<ol>" +
				  "<li>增加打开远程路由盘出错时的错误提示</li>" + 
				  "<li>增加远程下载完成提示</li>" + 
				  "<li>修复验证码不清晰的bug</li>" + 
				  "<li>修复登录时用户名太长无法输入的bug</li>" + 
				  "<li>修复因电脑时间错误而无法登录的bug</li>" + 
				  "<li>修复使用邮箱、手机号登陆并记住密码，再次登陆失败的bug</li>" + 
				  "<li>修复远程打开BT下载崩溃的bug</li>" + 
				  "<li>修复某些情况下BT下载失败的bug</li>" + 
				  "<li>切换到小米路由器Mini时，增加暂不支持的错误提示</li>" + 
				  "<li>修复记住密码后修改账号仍能登录的bug</li>" + 
				  "<li>修复小米路由器ROM0.4.85版本下，管理后台链接不能打开bug</li>" + 
				"</ol>" +
				"<p>Mac Client 更新日志：</p>" +
				"<ol>" +
				  "<li>切换到小米路由器Mini时，增加暂不支持的错误提示</li>" + 
				  "<li>修复开启动态密码保护登录时，输入错误导致客户端卡死bug</li>" + 
				  "<li>去掉迅雷云播功能</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM for 小米路由器Mini",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_045f6_0.3.84.bin",
			"time": 1405008000000,
			"type": "blue",
			"title": "本周是OTA双周功能稳定周",
			"content": 
			  "<p>本周是OTA双周功能稳定周，主要针对现有功能的稳定性进行调试，同时修复了一些已知bug。请大家继续测试各项功能，有问题请在米聊公测群中反馈，谢谢！</p>" + 
				"<ol>" +
				  "<li>增加了安全中心的无线MAC地址过滤功能，让家中无线网络更安全</li>" + 
				  "<li>修复了DHCP静态IP分配功能的一点小问题</li>" + 
				  "<li>修复了端口转发功能的一些问题</li>" + 
				  "<li>针对公测群大家提出的一些细节做了优化</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第30周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_08d23_0.6.51.bin",
			"time": 1404921600000,
			"type": "blue",
			"title": "本周针对反馈的问题进行了修正和调整，并做了底层优化",
			"content": 
			  "<p>本周针对来自小米社区、微博、微信平台上大家反馈的问题进行了修正和调整，与此同时我们还做了很多底层优化，为美好的未来打基础。本周修正的问题也请大家多体验多反馈，我们依旧全力以赴。</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了智能场景中，定时开机后不能联网的问题</li>" + 
				  "<li>优化了PPPoE对特殊拨号的支持</li>" + 
				  "<li>优化了OTA升级的相关逻辑</li>" + 
				  "<li>增加了对host规则里不同类型规则的支持</li>" + 
				  "<li>增加了对未来几个插件的底层支持，但暂时还看不到他们：P</li>" + 
				"</ol>" +
				"<p>Android App更新日志：</p>" +
				"<ol>" +
				  "<li>下载管理的编辑模式下增加支持开始和暂停功能</li>" + 
				  "<li>全新改版升级中使用其他手机查看时的界面</li>" + 
				  "<li>修复文件拾取器显示中照片旋转的问题</li>" + 
				  "<li>修复断网时app弹出到手机前台的问题</li>" + 
				  "<li>升级界面细节优化</li>" + 
				"</ol>" +
				"<p>小米电视 更新日志：</p>" +
				"<ol>" +
				  "<li>路由器相册页面全新改版</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi ROM for 小米路由器Mini",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/r1cm/miwifi_r1cm_all_7ab71_0.3.69.bin",
			"time": 1404403200000,
			"type": "blue",
			"title": "本周是OTA每周更新的单周新增功能周",
			"content": 
			  "<p>本周是OTA每周更新的单周新增功能周，增加了很多大家期待已久的功能！</p>" + 
				"<ol>" +
				  "<li>增加了UPnP支持，需要用到UPnP的应用会有更爽快的体验了，迅雷开启UPnP后的速度你们懂</li>" + 
				  "<li>增加了DHCP静态IP分配，为自己经常连接的设备分配固定IP，熟悉/陌生 一目了然</li>" + 
				  "<li>增加了动态域名DDNS，支持花生壳、公云等常用的DDNS服务，外网访问家里路由器更方便</li>" + 
				  "<li>增加了端口转发，支持外网通过路由器访问到内网的各端口的设备</li>" + 
				  "<li>增加了DMZ主机的支持，一个很厉害的功能，不是很明白该功能的用户建议不要轻易开启</li>" + 
				  "<li>增加了安全中心，更多安全相关功能coming soon</li>" + 
				  "<li>优化了路由器设置页面的菜单层级与排列方式</li>" + 
				  "<li>优化了系统状态的功能布局</li>" + 
				  "<li>修复了一些公测期间大家提到的问题</li>" + 
				"</ol>" +
			  "<p>本周的版本增加了很多新功能，欢迎大家在升级后使用的过程中随时通过公测QQ群、米聊群以及小米产品用户开发平台反馈使用中遇到的问题与建议 ：)</p>"
			},
	  {
			"logtype": "MiWiFi 第29周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_aba79_0.6.37.bin",
			"time": 1404316800000,
			"type": "blue",
			"title": "本周是性能稳定周",
			"content": 
			  "<p>本周是性能稳定周，除了修复了已有的部分bug外，我们对Android App的使用体验和PC客户端的功能进行了升级。好玩不好玩，大家得下载更新了亲自试试：）世界杯激战正酣，大家周末看球+刷机都别耽误，且折腾且珍惜……</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修改刷机时MD5验证方案，让刷机更加靠谱</li>" + 
				  "<li>修复了DHCP上网时偶现的域名解析失败的bug</li>" + 
				  "<li>升级了LZO压缩库，堵上了一个潜在的安全漏洞</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
					"<li>重构版本升级界面，统一展示当前版本信息</li>" + 
					"<li>优化升级过程体验，增加整体进度和时间预估，升级状态一目了然</li>" + 
					"<li>减少升级过程出现网络超时的情况</li>" + 
					"<li>解决Android 4.4 web view 不支持文件拾取器的问题</li>" + 
					"<li>WiFi设置增加强加密及不加密选项， 保护你的网络安全</li>" + 
					"<li>调整分类拾取器样式，界面更美观</li>" + 
					"<li>优化设备列表布局，可以更直观查看各设备的联网速度和连接时间</li>" +
				"</ol>" +
				"<p>PC Client 更新日志：</p>" +
				"<ol>" +
				  "<li>支持远程登录、远程下载及远程文件管理</li>" + 
				  "<li>支持一个小米账号绑定的多台路由器之间的切换</li>" + 
				  "<li>支持对下载任务进行全选、多选及批量开始、暂停、删除的操作</li>" + 
				  "<li>去掉管理密码登录方式，你可以通过小米账号登录</li>" + 
				  "<li>修复了资源管理器偶现的卡死问题</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第28周更新",
			"link": "http://bigota.miwifi.com/xiaoqiang/rom/brcm4709_hdk_6b6eb_0.6.22.bin",
			"time": 1403712000000,
			"type": "blue",
			"title": "本周功能和插件上新，DDNS（动态域名解析）功能正式推出",
			"content": 
			  "<p>本周功能和插件上新，DDNS（动态域名解析）功能正式推出，目前支持花生壳等几个主流的服务，外部访问小米路由器的功能可以玩起来了。</p>" + 
			  "<p>另外本周推出一个名为光影照片管家的插件，可以帮你把手机里的照片妥妥的管理起来，大家玩起来吧~</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了一个新插件，光影照片管家（目前仅有Android版本）</li>" + 
				  "<li>增加了动态域名（DDNS）功能，支持花生壳等几个DDNS服务</li>" + 
				  "<li>优化了应用限速的策略，在限制迅雷和快盘下载/上传的同时不会过多的占用CPU资源</li>" + 
				  "<li>优化了设置页的菜单分类与排序</li>" + 
				  "<li>修复了DHCP静态IP绑定功能手工输入与绑定可能失败的bug</li>" + 
				  "<li>修复了DMZ功能在路由器reset之后仍然默认开启的bug</li>" + 
				"</ol>" +
				"<p>IOS App 更新日志：</p>" +
				"<ol>" +
				  "<li>支持播放主流视频、音频格式</li>" + 
				  "<li>支持查看主流文档文件</li>" + 
				  "<li>增加支持打开已下载列表中的文件</li>" + 
				  "<li>优化二维码扫描下载体验</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>增加支持插件升级</li>" + 
				  "<li>增加迅雷会员到期提醒</li>" + 
				  "<li>增加发现新路由器时，弹出绑定页面</li>" + 
				  "<li>优化了rom升级体验</li>" + 
				"</ol>" +
				"<p>小米盒子 更新日志：</p>" +
				"<ol>" +
				  "<li>路由器视频页面改版，支持用首字母快速查找影片</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第27周更新",
			"link": "",
			"time": 1403107200000,
			"type": "blue",
			"title": "本周我们继续“修内功”",
			"content": 
			  "<p>除了修正上一版本已知的bug，提升了Rom稳定性外，现在你可以方便的在Android App中搜索影片资源，Mac客户端增加了支持远程登录、远程下载及远程文件管理的功能。同时更多Rom新功能、插件以及IOS App新版本也在路上了，敬请期待！</p>" + 
				"<p>ROM 更新日志：</p>" +
				"<ol>" +
				  "<li>修复了端口转发和DMZ配置在升级后丢失的bug</li>" + 
				  "<li>校准了智能场景中的定时时间，启停更准确</li>" + 
				  "<li>修复了智能场景中小米电视开机偶尔失效的bug</li>" + 
				  "<li>优化了rom安装文件的大小，略略的减了肥</li>" + 
				"</ol>" +
				"<p>Android App 更新日志：</p>" +
				"<ol>" +
				  "<li>增加了搜片功能，下片更迅捷</li>" + 
				  "<li>增加了对离线路由器的操作引导</li>" + 
				  "<li>优化了路由器绑定流程</li>" + 
				  "<li>主界面增加了显示当前上网速度和历史最高速度</li>" + 
				  "<li>解决添加或删除智能场景后,在其它终端上显示不一致的问题</li>" + 
				  "<li>修复删掉智能场景后仍显示在列表中的bug</li>" + 
				"</ol>" +
				"<p>Mac客户端更新日志：</p>" +
				"<ol>" +
				  "<li>支持远程登录、远程下载及远程文件管理</li>" + 
				  "<li>支持一个小米账号绑定的多台路由器之间的切换</li>" + 
				  "<li>支持对下载任务进行全选、多选及批量开始、暂停、删除的操作</li>" + 
				  "<li>去掉管理密码登录方式，你可以通过小米账号登录</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第26周更新",
			"link": "",
			"time": 1402502400000,
			"type": "blue",
			"title": "本周是性能优化周",
			"content": 
			  "<p>我们修复了Rom中的一些已知bug，提升系统稳定性。</p>" + 
				"<p>同时优化了Android App的使用体验。大家期待的DDNS功能将在下周和一个新插件一起推出，敬请期待！</p>" + 
				"<p>ROM 更新日志：</p>" + 
				"<ol>" + 
				  "<li>修复PPPoE上网时，偶现QoS无法限制上传流量的bug</li>" +
				  "<li>升级了OpenSSL库，堵住了一个潜在的安全漏洞</li>" +
					"<li>修复路由器重启时，连接设备的上线时间显示错误的问题</li>" +
					"<li>新增DMZ主机功能，支持将局域网内某一个设备的IP直接映射给外网，方便从外网访问NAS等设备</li>" + 
					"<li>优化了web管理后台的session超时策略，登录安全更加有保障</li>" +
					"<li>修复了小米电视/盒子通过DLNA访问路由器有个别文件夹无法显示的问题</li>" + 
				"</ol>" +
				"<p>Android app 更新日志：</p>" +
				"<ol>" + 
				  "<li>优化路由器解绑逻辑，解决不能解绑或者不能绑定的问题</li>" +
				  "<li>增加路由器升级提示</li>" +
				  "<li>在线显示升级日志，更加美观和准确</li>" +
					"<li>绑定新路由时，自动切换到新路由</li>" + 
					"<li>修复登录小米账号失败时，错误提示用户绑定路由器的问题</li>" + 
					"<li>解绑后，自动跳转到可用路由器</li>" + 
					"<li>增加实时在线、离线状态信息，路由在不在线一目了然</li>" + 
					"<li>修正文件管理功能的部分文案</li>" + 
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第25周更新",
			"link": "",
			"time": 1401897600000,
			"type": "blue",
			"title": "新增QoS智能限速功能，让大家久等了！",
			"content": 
			  "<p>第一版的QoS支持系统自动或手工设置为不同设备分配带宽(网速)，让同时在线的不同设备更合理的分享下载与上传网速，再也不用担心一边看优酷一边打游戏会掉线的问题了。</p>" + 
				"<p>后续还会支持根据不同应用更加智能的自动带宽分配，敬请期待</p>" + 
				"<p>ROM 更新日志：</p>" + 
				"<ol>" + 
				  "<li>新增外网测速功能，为QoS智能限速提供外网带宽检测，更好的保证QoS基于正确的外网带宽为不同设备分配网速。如果测速结果和你的宽带运营商告知你的带宽差别太大，建议关闭所有会占用带宽的应用之后重新测试，这样可以确保测速结果的准确性</li>" +
					"<li>新增端口转发功能，支持通过外网访问内网各设备/各端口，如果你不是很明白这个功能的作用，建议不要轻易开启。DDNS也将在近期更新</li>" +
					"<li>智能场景，新增暂停或开启所有下载，你可以在执行任务里添加</li>" + 
				"</ol>" +
				"<p>小米电视：</p>" +
				"<ol>" + 
				  "<li>我们为通过路由器、小米盒子播放的音乐MV穿上了漂亮的外衣，你可以感受一下...</li>" +
				"</ol>"
			},
	  {
			"logtype": "MiWiFi 第24周更新",
			"link": "",
			"time": 1401292800000,
			"type": "blue",
			"title": "本周的主题仍然是提升稳定性与修复问题",
			"content": 
			  "<p>以后大家会发现开发版的发布节奏都将为：单周新增功能，双周提升稳定/修复问题。</p>" +
				"<p>增加部分：</p>" + 
				"<ol>" + 
				  "<li>新插件，搜狗网页加速，预加载功能嗷嗷的快</li>" + 
				  "<li>增加支持对小米电视2和小米盒子增强版的开机控制</li>" + 
				"</ol>" + 
				"<p>优化部分：</p>" + 
				"<ol>" + 
				  "<li>优化了PPPoE拨号在少部分地区可能遇到的拨号失败问题</li>" + 
				  "<li>优化了无线MAC过滤功能的细节体验</li>" + 
				  "<li>优化了一些文案的细节，很细的细节</li>" + 
				  "<li>优化了Wi-Fi对小米1手机的连接兼容性</li>" + 
				"</ol>" + 
				"<p>修复部分：</p>" + 
				"<ol>" + 
				  "<li>修复了手工升级模式在部分浏览器下的兼容性问题</li>" + 
				  "<li>修复了临时文件夹满了之后可能带来的小问题</li>" + 
				  "<li>修复了文件管理创建文件夹时某些特殊字符可能带来的问题</li>" + 
				  "<li>修复米1休眠后连接小米路由器不正常的Bug</li>" + 
				"</ol>" + 
				"<p>Android App：</p>" + 
				"<ol>" + 
				  "<li>新增智能场景：定时关机，快去体验一下吧</li>" + 
				  "<li>优化了“扩展插件”的交互界面，更稳定易用了</li>" + 
				  "<li>解决了多个路由器切换时可能会引起的主界面状态显示错误的问题</li>" + 
				  "<li>修复了下载时偶现的崩溃问题</li>" + 
				"</ol>" + 
				"<p>下周预告：万众期待的QoS/端口转发/DMZ/DDNS ……不出意外这些功能会在下周与大家正式见面。</p>"
			},
	  {
			"logtype": "MiWiFi 第23周更新",
			"link": "",
			"time": 1400688000000,
			"type": "blue",
			"title": "本周新增了这么多功能，请小伙伴们细细品味吧！",
			"content": 
			  "<p>路由器ROM本周更新日志</p>" +
			  "<p>增加部分：</p>" +
				"<ol>" + 
				  "<li>官方支持打开SSH功能，并可以在web端打开开发者调试选项，详情请查看miwifi官网</li>" + 
					"<li>无线MAC地址过滤功能，支持黑/白名单模式，让您随心控制无线访问权限，黑白通吃</li>" + 
					"<li>PPPoE拨号的状态显示、错误显示与手工断开/重连 功能，帮您更好的了解当前拨号状态</li>" + 
					"<li>DHCP的静态IP地址分配功能，经常连接的设备谁是谁非，一目了然</li>" + 
					"<li>页脚对基本信息和常用链接的展示</li>" + 
				"</ol>" + 
				"<p>优化部分：</p>" + 
				"<ol>" + 
				  "<li>时间同步NTP服务的策略，解决了之前因为系统时间不准确带来的登录失败等问题</li>" + 
					"<li>MTU策略，解决了小部分DHCP用户可能遇到的网页无法打开问题</li>" + 
					"<li>PPPoE拨号功能，解决了小部分地区某些ISP一段时间没有网络流量就会断开的问题</li>" + 
					"<li>域名解析策略，解决了可能偶尔会遇到的域名解析错误问题</li>" + 
					"<li>2.4G/5G的信号强度调节功能，现在您可以根据需要分开设置信号强度了</li>" + 
					"<li>日志上传功能，当您遇到问题需要帮助的时候我们可以根据您上传的日志更快的判断原因</li>" + 
					"<li>web管理后台的页脚，就是那个您平时可以没注意到的页面最下部</li>" + 
					"<li>安全恢复系统的时间同步/网络参数同步策略</li>" + 
					"<li>升级了内置的迅雷引擎，迅雷的小伙伴做了很多优化工作</li>" + 
					"<li>让原本不该出现的空白插件消失了</li>" + 
				"</ol>" + 
				"<p>修复部分：</p>" + 
				"<ol>" + 
				  "<li>修复了硬盘在某些情况下频繁启动甚至偶尔带来风扇提速的问题</li>" + 
					"<li>修复了2.4G使用路由快连（WPS）时的连接问题</li>" + 
					"<li>修复了2.4G对部分老网卡（如intel迅驰的6205）的兼容性问题，但还是建议网卡太老的用户换一个支持AC的</li>" + 
				"</ol>" + 
				"<p>Android app本周更新日志：</p>" + 
				"<ol>" + 
				  "<li>支持批量编辑下载任务</li>" + 
					"<li>图片资源优化，APP大瘦身</li>" + 
					"<li>新增支持手机右下角的返回键</li>" + 
					"<li>修复因格式不正确导致首页状态列表显示错误的bug</li>" + 
				"</ol>" + 
				"<p>iOS app本周更新日志：</p>" + 
				"<ol>" + 
				  "<li>支持批量编辑下载任务</li>" + 
					"<li>新增路由检测功能，让你的路由器越检越健康</li>" + 
					"<li>插件功能优化，不用等待资源页面加载完成也可点击使用</li>" + 
					"<li>你现在不仅可以给单台小米路由器进行升级，也可以为多台小米路由器进行集中升级管理</li>" + 
					"<li>我们设置了预缓存，进入智能场景管理页面的速度明显变快了</li>" + 
					"<li>你可以给路由盘设置访问权限了</li>" + 
				"</ol>" + 
				"<p>本周大家的使用反馈小米路由器团队都抄收了，整个团队正在日夜兼程的为各项功能进行完善，我们一起加速！</p>" 
			},
	  {
			"logtype": "MiWiFi 第22周更新",
			"link": "",
			"time": 1400169600000,
			"type": "blue",
			"title": "增加MTU包大小设置功能，简化路由插件本地安装",
			"content": "<p>ROM 更新日志：</p><ol><li>PPPoE拨号支持MTU包大小设置，原本无法拨号上网的情况可以调整MTU改善</li><li>优化WiFi信道/强度设置体验，将2.4G和5G信道及带宽设置分离</li><li>进一步提升系统稳定性，解决了部份用户碰到的亮红灯的问题</li><li>现在你可以在web页面最下方看到版本相关信息</li><li>修复智能场景在系统服务对时失败时执行错误的问题</li></ol><p>Android app更新日志：</p><ol><li>支持左右滑动浏览路由器内图片</li><li>优化批量下载时进程堵塞的问题，让体验更流畅</li><li>修复偶现的下载列表无法刷新的问题</li><li>首页美容，去看看我是不是更漂亮了</li><li>简化路由插件本地安装体验</li></ol><p>体验的优化，让你的玩机旅程更加舒畅！</p>"
			},
	  {
			"logtype": "MiWiFi 第21周更新",
			"link": "",
			"time": 1399564800000,
			"type": "blue",
			"title": "“路由设置”升级，迅雷电影院的新插件上架",
			"content": "<p>ROM 更新日志：</p><ol><li>解决了部分地区用户上网断线或拨号失败的问题，还在继续解决</li><li>优化了2.4G信道选择，帮你选择更靠谱的网络信道</li><li>新插件！迅雷电影院上架，这里能找到你想要</li><li>初始化时，上网密码和后台管理密码可以分开独立设置，让帐号更安全</li><li>修正了设置密码对部分特殊字符的处理不正确</li><li>你会发现web端的“路由设置”有了新变化哦，为加入更多的高级功能做准备</li><li>不用再担心红灯！如果你发现路由器红灯闪烁是因为启动失败进入了安全恢复系统，进入web管理后台可以让路由器恢复正常</li><li>Web端可以将SSID隐藏起来了</li><li>Web端可以通过管理密码登陆了，用小米帐号登陆手机客户端会更便捷一些哦</li><li>Web端的应用管理消失了，但是手机端你会发现更多的应用插件</li><li>无线网络密码更安全了，因为我们采用了更高级的AES加密算法</li><li>Web端手动信道选择更加友好了</li></ol><p>Android app 更新日志：</p><ol><li>支持通过二维码扫描下载资源</li><li>新增支持动态口令登录，让登录更加便捷</li><li>增加对隐私盘使用的引导，手把手教你把XXX藏起来</li><li>新增路由检测功能，让你的路由器越检越健康</li><li>支持对文件的重命名了</li><li>如果你有小米电视或小米盒子，你会在智能设备里发现你的新摇控器</li></ol><p>小米盒子(增强版)更新日志：</p><ol><li>支持迅雷专用xvx格式的影片</li></ol>"
			},
	  {
			"logtype": "小米路由器首轮发售",
			"link": "",
			"time": 1398355200000,
			"type": "orange",
			"title": "10万台小米路由器59秒售罄",
			"content": "<p>4月23日18:00于小米网mi.com开放预约</p><p>4月25日10万台699元小米路由器59秒售罄</p>"
			},
	  {
			"logtype": "MiWiFi 第20周更新",
			"link": "",
			"time": 1398355200000,
			"type": "blue",
			"title": "优化CPU占用率高的问题",
			"content": "<p>ROM 更新日志：</p><ol><li>修复偶现的绑定或登陆小米帐号失败的Bug</li><li>修复偶现的因恢复系统故障而导致路由器无法工作的Bug</li><li>花了很大力气保证网页安全，因为我们对安全问题是非常重视的</li><li>迅速修复了CPU忙的问题</li></ol><p>Android App 更新日志 : </p><ol><li>优化了智能设备和智能场景列表刷新机制，让你更快体验</li><li>增加了从本地安装插件的入口，用户可以通过论坛或者其他方式下载并安装小米路由插件</li><li>设置里增加了存储设置功能，用户可以定义是否允许新连入的设备访问路由共享盘，以及是否允许其他设备修改路由存储器上的数据</li><li>设置里增加了NFC设置功能，用户可以向路由器上的NFC Tag写入上网密码，NFC相互触碰，即可无密码快速连接路由器</li></ol>"
			},
	  {
			"logtype": "小米新品新品新品沟通会",
			"link": "",
			"time": 1398182400000,
			"type": "green",
			"title": "小米路由器正式发布",
			"content": "<p>小米路由器=小型家用服务器，深度定制miwifi系统</p><p>四大定位瞄准智能家居控制中心：打造最好的路由器、家庭数据中心、智能家庭中心以及开放平台</p>"
			},
	  {
			"logtype": "MiWiFi 第19周更新",
			"link": "",
			"time": 1397750400000,
			"type": "blue",
			"title": "iOS APP震撼登陆",
			"content": "<p>ROM 更新日志：</p><ol><li>大大的优化了升级，解决了部份用户反馈的，因版本太老而无法升级的问题</li><li>修复了当图片格式后辍大写时，缩略图不能正常显示的问题</li><li>修复了文件数目显示不准确的问题，隐藏文件的数目将不会被显示</li><li>WiFi信号强度默认设为标准，你可以在WiFi高级设置里自行调整</li><li>校正流量统计，让你更精准的知道流量的使用情况</li><li>校正路由器云备份的进度</li><li>我们暂时去掉了”苹果商店加速”的功能，等优化好了还是会再回来的</li></ol><p>Android App 更新日志：</p><ol><li>全新的Android App，快来体验吧</li><li>首页新增“外网速度&内网速度”，网络状况一目了然</li><li>首页新增事件list,随时随地掌握路由器的一切动态</li><li>我们正在努力丰富”扩展插件”，让你体验更多优质服务</li><li>向左滑，向右滑，滑滑乐趣多</li><li>更多有趣体验，等你来探索吧</li></ol><p>iOS App 更新日志：</p><p>iOS App 已经登陆Appstore ,快来尝鲜吧！</p>"
			},
	  {
			"logtype": "MiWiFi 第18周更新",
			"link": "",
			"time": 1397145600000,
			"type": "blue",
			"title": "让硬盘劳逸结合",
			"content": "<p>ROM 更新日志：</p><ol><li>对磁盘的性能进行了优化，让它睡眠充足，寿命更长</li><li>修复了偶现的拷贝大个头文件失败的问题</li><li>堵上了近期炒得火热SSL漏洞，让您的数据加倍安全</li><li>修复了您手动选择某一WiFi信道，但却遗憾的没能生效的问题</li></ol><p>Android App 更新日志：</p><p>全新改版，闭关潜修中</p>"
			},
	  {
			"logtype": "MiWiFi 第17周更新",
			"link": "",
			"time": 1396540800000,
			"type": "blue",
			"title": "双平台APP升级中",
			"content": "<p>本周未有更新，下周静候佳音</p><ol><li>iPhone app已在开发进行中，大家可以放心了</li><li>Android app继续改版中，攻城师们还在努力</li><li>修复Bug若干</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第16周更新",
			"link": "",
			"time": 1395936000000,
			"type": "blue",
			"title": "DLNA支持GIF格式，优化了手机端的信息推送",
			"content": "<p>ROM 更新日志：</p><ol><li>DLNA支持GIF格式</li><li>优化了消息推送服务，多个手机客户端可以同时收到消息通知</li><li>我们正在进行应用中心的大改版，支持第三方开发者提交插件，敬请期待</li></ol><p>Android App更新日志：</p><ol><li>华丽丽的改版升级ing，无限激情，无限想象，请随意YY</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第15周更新",
			"link": "",
			"time": 1395331200000,
			"type": "blue",
			"title": "优化APP端智能家居新建设备的流程",
			"content": "<p>ROM更新日志：</p><ol><li>优化并提升了DLNA读取隐私盘内容的速度</li><li>修复了DLNA读取图片时偶而出错的问题</li><li>优化DLNA和SAMBA对磁盘读写频率，以延长磁盘的使用寿命</li><li>修复了偶现的访问DLNA时，文件夹及子文件夹显示不全的问题</li></ol><p>Android App 更新日志：</p><ol><li>修复了频繁或大量读取文件内容时偶而会出现失败的问题</li><li>将两个路由快连功能合并，现在你可以通过智能设备里的路由快连统一连接设备了</li><li>优化了智能家居新建设备的流程，让体验更加流畅</li><li>路由快连新增了取消连接设备的功能，如果你不想连接设备了，随时可以取消</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第14周更新",
			"link": "",
			"time": 1394726400000,
			"type": "blue",
			"title": "增加小米路由NAS访问权限",
			"content": "<ol><li>进一步优化了隐私盘体验，现在你可以分开对每个终端设置隐私盘和共享盘访问权限了</li><li>我们加强了对设备是否连接上路由器的状态检测，不会再出现提示已经连接上，但实质却没有的“囧”况了</li></ol>"
			},
	  {
			"logtype": "小米路由器第三轮公测",
			"link": "",
			"time": 1394121600000,
			"type": "green",
			"title": "把家变成大玩具",
			"content": "<p>第三轮公测：2014年3月7日，玩转智能家居</p><p>小米路由器发布新玩法——智能家居控制中心，个人定制家居模式，随时随地玩转智能生活</p>"
			},
	  {
			"logtype": "MiWiFi 第13周更新",
			"link": "",
			"time": 1394121600000,
			"type": "blue",
			"title": "PPTP&L2TP，来了！",
			"content": "<ol><li>如果你懂PPTP&L2TP的话，那么你可以去捣鼓捣鼓了</li><li>你可能不会关心信道是神马，而是更关心当前的网络带宽，现在你可以在WEB管理页面的“系统状态”里清楚的看到了</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第12周更新",
			"link": "",
			"time": 1393516800000,
			"type": "blue",
			"title": "增加了智能家居模块",
			"content": "<ol><li>终于，我们合入了智能家居模块！你可以在“智能设备”界面找到入口</li><li>我们开发完成了隐私盘功能；总有一些文件需要独处，现在你可以在“智能设备”和“文件管理”界面进行设置</li><li>现在起你可以远程读写路由器上的文件了；只需进入文件管理页面，开启路由器云备份</li><li>最后，我们和博通（主芯片供应商）的小伙伴们，一起改善了路由器在2.4G信号较弱时的网络传输速度</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第11周更新",
			"link": "",
			"time": 1392912000000,
			"type": "blue",
			"title": "除“虫”（BUG）周",
			"content": "<ol><li>音频文件的名字偶尔会出现乱码，现在不会了</li><li>在移动拨号网络下，下载速度慢的问题已经解决了</li><li>你可能会想要重新下载你已删除了的内容，以前错误的不被允许，现在不会了</li><li>通过网页或手机客户端重启路由器时，会偶现网络连接不上，现在已经修复了</li><li>有童靴反馈通过手机端上传文件时速度比较慢，所以我们去掉了对上传速度的限制，现在已经变快了呦</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第10周更新",
			"link": "",
			"time": 1392739200000,
			"type": "blue",
			"title": "提升登陆安全性",
			"content": "<ol><li>曾经，从快盘下载的文件，只能看却不能修改，现在都可以了</li><li>曾经，通过网页或手机端关闭路由器时，WAN口和LAN口的灯依然错误的闪亮着，现在我们让它安息了</li><li>另外，我们花了很大的力气做了安全登陆，请您相信，我们是非常关注您的密码安全问题的</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第9周更新",
			"link": "",
			"time": 1392307200000,
			"type": "blue",
			"title": "WEB管理页面优化",
			"content": "<p>这是马年的第一次更新，只有2项！因为你知道的，工程师们还沉浸在过年的喜悦中，令人庆幸的是：没有一个人在他乡做笔录</p><ol><li>我们对Web设置页做了一些细节优化，修改了Bug，设置体验更流畅</li><li>在系统启动出错时，路由器会错误的亮起黄灯，我们修正为红灯了</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第6周更新",
			"link": "",
			"time": 1390406400000,
			"type": "blue",
			"title": "优化使用体验",
			"content": "<ol><li>在路由器升级的时候，我们HOLD住了所有的下载任务，不过升级完成后，我们会自动的继续下载</li><li>在使用迅雷下载和金山云进行全盘备份的时候，你依然可以拥有很好的上网体验</li><li>在信号比较弱的情况下，2.4G的数据传输速度比以前快了</li><li>我们和迅雷的小伙伴们一起，进一步的提升了路由器的下载性能</li><li>我们优化了用户反馈的进行文件管理时找不到文件名的问题</li><li>我们更新了用户协议，（当然可能你不会关心），不过你需要知道的是我们是非常关注用户的隐私安全的</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第5周更新",
			"link": "",
			"time": 1389801600000,
			"type": "blue",
			"title": "增加限速功能",
			"content": "<ol><li>新增限速功能，可以通过Web端对迅雷下载、金山快盘备份进行限速设置了</li><li>DLNA支持RMVB和RM格式的视频文件</li><li>优化ROM升级时的下载速度，可以通过迅雷加速下载</li><li>优化域名解析，解决了可能出现解析错误的问题</li><li>优化Web首页的终端流量统计，偶现不显示设备名称的BUG</li><li>优化弱信号下，2.4G WiFi速率迅速降低的BUG</li><li>修改设置外网连接方式时，页面显示错误的BUG</li></ol>"
			},
	  {
			"logtype": "小米路由器第二轮公测",
			"link": "",
			"time": 1389628800000,
			"type": "green",
			"title": "小米路由器1元公测",
			"content": "<p>第二轮公测：2014年1月14日开启发烧友新福利，1元体验新玩法</p><p>根据发烧友建议，迭代17个版本，改进上百个功能点</p><p>支持应用中心APPS插件扩展，支持NFC新玩法等</p>"
			},
	  {
			"logtype": "MiWiFi 第4周更新",
			"link": "",
			"time": 1389283200000,
			"type": "blue",
			"title": "除“虫”（BUG）周",
			"content": "<ol><li>改善2.4G弱信号下WiFi吞吐量</li><li>改善IE7浏览器查看WEB页面的兼容问题</li><li>优化DLNA模块，让你看片更爽</li><li>优化升级检测，以后不会总是出现升级检测失败的BUG</li><li>修复WAN口没有连接网线的时候CPU占用高的BUG</li><li>修复迅雷存在的一些问题，让下载更加稳定顺滑</li><li>修复升级后用户的DHCP段被冲掉的BUG，以后升级不用每次重新去设置啦</li><li>修复快盘大文件也会尝试重传的BUG</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第3周更新",
			"link": "",
			"time": 1388678400000,
			"type": "blue",
			"title": "优化各种“速度”",
			"content": "<ol><li>快盘同步时可以限制速度了，迅雷下载也可以限制速度了，你可以一边同步、一边下载、一边上网了 </li><li>优化了迅雷下载功能，全力以赴追求更快的速度</li><li>优化了终端管理的页面，美美的</li><li>增加了对UPnP的支持，可以在 高级功能 中开启</li><li>让启动速度更快了，提升了300%</li><li>启动后LED指示灯亮灯的速度也变快了</li><li>客户端上传文件到路由器的大小不再受限，可以尽情上传大文件了</li><li>修正偶发的网络启动失败</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第2周更新",
			"link": "",
			"time": 1388073600000,
			"type": "blue",
			"title": "解决基础管理问题",
			"content": "<ol><li>和迅雷一起，对迅雷引擎做了更多优化</li><li>对硬盘使用不当导致的红灯问题进行了优化</li><li>底层增加了一些 全球加速 的准备工作</li><li>外网WAN口的状态检测比以前更迅速</li><li>现在用Android设备浏览器访问管理页面，在客户端下载中可以直接下到App安装包</li><li>如果检测到系统有升级，路由前面蓝灯会闪烁提醒</li><li>在Web和App端增加了关机功能：请注意，如果要拔电源，请一定先关机</li><li>快盘以前偶尔出现同步错误或状态不准确的问题，现在我们解决了</li><li>如果你不想给WiFi设密码，现在从WiFi设置或高级WiFi设置都能直接设置了</li><li>现在你Web上进行系统升级，在下载升级包的过程中可以对升级进行取消</li><li>硬盘空间的呈现使用了实际计算的大小</li></ol>"
			},
	  {
			"logtype": "MiWiFi 第1周更新",
			"link": "",
			"time": 1387468800000,
			"type": "blue",
			"title": "MiWiFi ROM 第1周更新",
			"content": "<ol><li>高大上的“路由器云备份”功能终于可用了，感谢金山快盘。现在你硬盘里的重要数据可以放进去并自动云端同步了。</li><li>增加路由应用“共享模式”，你可以设置新连接路由器的设备是否能访问路由器硬盘以及是否能修改数据</li><li>之前苹果App Store的访问问题已经得到迅猛修复</li><li>修复了一些可能导致系统重启的问题</li><li>迅雷引擎进一步优化。我们会把它做到最牛的</li><li>默默激活了QoS和UPnP基础支持，正式可用要再等等（不懂的请飘过）</li><li>修复了Web上自动升级进度条可能卡住、用户不知道在干啥的问题</li><li>文案错误修改：所有该写“稍候”的地方不会再有错别字了</li><li>网络检测性能大幅优化，速度提升显著</li><li>因为跟基础服务相关，默认的路由器应用“访客模式”、“迅雷云加速”和“路由器云备份”不可卸载</li><li>小米路由器不支持IE6内核的浏览器，会在页面有明确提示</li></ol>"
			},
	  {
			"logtype": "小米路由器首轮公测",
			"link": "",
			"time": 1387382400000,
			"type": "green",
			"title": "小米路由器“木盒”公测正式发售",
			"content": "<p>首轮公测：12月19日公测版正式发售</p><p>63万发烧友申请资格</p><p>定制木盒，用户DIY组装小米路由器，熟悉了解每个部件</p><p>复杂地玩，为了极致简单地用</p>"
			},
	  {
			"logtype": "小米路由器正式发布",
			"link": "",
			"time": 1384876800000,
			"type": "green",
			"title": "给发烧友的新玩具",
			"content": "<p>小米路由器正式对外公布</p><p>新款高端配件产品，各项顶级配置，在发烧友手中没有什么不可以玩</p>"
			}
	];
